{"Attentes":{"title":"Attentes","links":[],"tags":[],"content":"Mon travail va beaucoup consister en de la recherche, donc j’ai très hâte de toucher à ce genre de tâches. En général je sais que je peux me fasciner pour un sujet assez intensément et rapidement, j’attends de voir comment je vais gérer le fait de garder cette passion dans le temps.\nRelations\nTODO"},"Lettre-de-motivation":{"title":"Lettre de motivation","links":[],"tags":[],"content":"Bonjour,\nPermettez moi de me présenter brièvement, je suis étudiant en MA1 en ingénierie informatique à l’école polytechnique de Bruxelles (Université libre de Bruxelles). Dans le domaine de l’informatique, je suis intéressé par la computer vision, le traitement de signal et la micro-informatique. En dehors de mes études je suis passionné de musique, je joue dans quelques projets et j’apprends la production musicale depuis quelques années déjà.\nJ’ai entendu parler d’Ohme par des amis de l’ULB qui ont effectué un stage chez vous. En parcourant les projets d’Ohme, j’ai immédiatement ressenti une affinité avec votre entreprise. Votre mission et votre approche correspondent parfaitement à mes aspirations professionnelles. Je suis convaincu que je pourrais apporter une contribution significative à votre équipe grâce à mes compétences et mon enthousiasme.\nJe suis actuellement à la recherche d’un stage de MA2, d’une durée de 3 mois, s’étalant d’août à octobre. Si votre entreprise est à la recherche d’un stagiaire durant cette période, je serais ravi de vous rencontrer pour discuter plus en détail de ma candidature.\nJe vous prie de trouver ci-joint mon CV. Je vous remercie pour l’attention que vous porterez à ma candidature.\nBien cordialement,\nPhilippe Mutkowski"},"Log-book/29-09-24":{"title":"29-09-24","links":[],"tags":[],"content":""},"Log-book/Log-book":{"title":"Log book","links":[],"tags":[],"content":""},"Log-book/Semaine-1":{"title":"Semaine 1","links":[],"tags":[],"content":"Logs\n29-09-24\nQuoique anecdotique, je voulais tout de même partager une nouvelle technique qu’un de mes collègue utilise pour communiquer avec chatGPT. Cela consiste à lui détailler un contexte précis et ensuite réaliser un “mind dump”, c’est à dire donner pleins d’idées en vrac, peu ou pas structurées du tout. Il arrive à créer quelque chose d’assez pertinent et permet de structurer ses pensées. Utile typiquement au début de nouveaux projets.\nRapport hebdomadaire\nLe début de semaine a consisté à déménager les bureaux. Bien que les tâches réalisées sont à des années lumières de ce qui était prévu dans ma convention de stage, cela m’a tout de même permis de rencontrer l’équipe dans un contexte un peu plus détendu. J’ai pu en apprendre d’avantage sur le fonctionnement de l’entreprise. Quelles sont leurs missions, quel est le rôle des gens dans l’équipe.\nLa 2e partie de la semaine consistait surtout à lire les travaux précédent les miens pour comprendre entre autre les outils que je vais utiliser pour le projet “biométrie”. J’ai lu le mémoire qui parlait de la réalisation de la chaîne d’acquisition utilisée par Ohme pour utiliser des signaux EEG. Il y a quelques concepts que j’étoffe avec le cours d’instrumentation donné en option électro-mécanique.\nRaoul m’a également montré les outils utilisés pour organiser le travail au sein de l’entreprise. C’est un environnement Google workspace. La puissance étant la centralisation du calendrier et des tâches. Il m’a montré le drive avec les dossiers pertinents pour mon projet et expliqué ce qui a sa place dedans.\nJe me sens bien intégré pour l’instant malgré la semaine (d’après eux) bizarre et inhabituelle pour un début de stage."},"Log-book/À-propos-de-la-candidature":{"title":"À propos de la candidature","links":[],"tags":[],"content":"Au moment de contacter une entreprise je prenais le soin de me renseigner sur celle ci et d’adapter mon CV en conséquence en mettant en valeur les compétences et intérêts pertinents pour le job. Quelques exemples : l’ajout de mes compétences de logiciels créatifs lors de ma candidature chez Ohme ou la mention que je m’intéresse beaucoup à la micro informatique lors de ma candidature chez Keymesis (entreprise de recherche et réalisation de prototypes)."},"Objectifs-et-tâches":{"title":"Objectifs et tâches","links":[],"tags":[],"content":"Ceci sont les tâches détaillées par Raoul Someillier, maitre de stage, à l’approche du début de celui-ci.\nProjet 1 : AI, communication inter/intraspécifique et visualisation\nIl s’agit d’un projet de R&amp;D et de soutien technique en collaboration avec l’artiste Antoine Bertin qui est en résidence chez nous.\nLes collaborateurs scientifiques sont des chercheurs du Earth Species Project (ESP), issus de diverses universités (surtout américaines). L’intention de leur travail de recherche est bien synthétiser sur leur site:\n“Our work to decode communication of other species builds on the extraordinary advances we are seeing in AI being applied to human language, which we are extending to the non-human world.\nIt also builds off many decades of bioacoustics and behavioral ecology research which has already uncovered complex communication systems in other species.\nThe machine learning models we are building are also supporting and deepening ongoing research into the behavior of other species and advancing conservation efforts on the ground today.”\nDans le cadre de notre collaboration, on s’intéresse surtout à la communication entre mammifères marins, en particulier des belugas.\nL’objectif est donc d’enregistrer une grande quantité de “discussions” entre belugas (par exemple entre une mère et son petit) et d’utiliser ces enregistrements audio comme data en input de modèles de machine learning (dans la même idée que des modèles de langage type ChatGPT mais pour la communication animale, donc sans la possibilité de transcrire en format texte). L’objectif ultime est donc de tenter de comprendre ce que les belugas se racontent. Mais avant ça, il faut faire de l’analyse audio pour déterminer les diverses dimensions impliquées, réduire la dimensionalité et compléter ce travail par des analyses comportementales.\nUn modèle développé par les chercheurs de ESP est AVES (Animal Vocalization Encoder based on Self-Supervision) : “a self-supervised, transformer-based audio representation model for encoding animal vocalizations (“BERT for animals”)“.\nLa mission du Ohme Lab dans ce projet est de :\n\nSe baser sur les travaux de ESP pour développer un code permettant d’analyser des vocalisations de beluga (dans un premier temps, peut-être aussi d’autres animaux par la suite, à voir).\nVisualiser le résultat de cette analyse, dans le sens de “rendre visuel” sur base de critères esthétiques définis avec Antoine Bertin.\nA noter que nous faisons aussi toujours attention au sens et à la vocation pédagogique de nos projets. Il s’agit donc également de faire en sorte que ces visualisations puissent être utilisées comme base pour expliquer des phénomènes scientifiques au grand public.\nModéliser ces visualisations afin de réaliser des sculptures tridimensionnelles (via impression 3D ou autre méthode de prototypage et de fabrication)\n\nProjet 2 : Biométrie, interactivité et rétroaction entre oeuvres et réactions humaines\nCe projet s’inscrit dans un axe de R&amp;D interne à Ohme qui vise à créer des boucles de rétroaction entre une oeuvre (installation d’art numérique, composition musicale, performance ou autre) et les réactions physiologiques, sensorielles, mentales et émotionnelles de la personne qui en fait l’expérience (spectateur ou performeur).\nEn d’autres termes, il s’agit de concevoir des œuvres qui provoquent des réactions humaines, de développer des technologies permettant de mesurer ces réactions, et d’utiliser ces mesures pour faire évoluer l’œuvre de façon dynamique et en temps réel.\nL’idée est donc :\n\nde développer des capteurs biométriques (ou adapter/hacker des technologies déjà existantes) servant à mesurer les réactions physiologiques humaines. Quelques exemples de capteurs : casque EEG pour mesurer les rythmes cérébraux, capteur de pression pour les pas, caméra depthsensing pour les déplacements, ECG pour les battements du coeur, etc.).\nd’envoyer ces signaux de mesure en wireless à un PC.\nde filter et d’analyser ces mesures pour en déduire des variations sur les états mentaux et/ou émotionnels des personnes qui portent ces capteurs biométriques.\nde visualiser ces variations afin qu’elles fassent partie intégrante de l’œuvre et/ou d’utiliser ces variations pour faire évoluer l’œuvre (au niveau sonore, visuel, cinétique ou autre).\nCes “évolutions” de l’oeuvre peuvent soit renforcer le changement d’état de la personne (rétroaction positive), soit l’atténuer (rétroaction négative). Avec toujours comme volonté que cela nous permette d’utiliser cette expérience vécue par le spectateur comme un moyen de mieux comprendre et d’acquérir de nouvelles connaissances (sur le fonctionnement de notre cerveau, de nos émotions, des technologies employées, etc.)\n\nComme décrit dans ta convention de stage, les missions concernent 3 volets :\n\nLe développement d’une boîte à outils software et hardware capable de recevoir en input une grande quantité de signaux provenant de capteurs biométriques et environnementaux.\nLe développement d’un modèle AI de classification capable de déterminer en temps réel les (variations d’) états émotionnels et mentaux d’une (ou plusieurs) personnes sur base des mesures prises par des capteurs biométriques.\nLa visualisation et la sonification des signaux (input et output), ce qui requiert la compatibilité des systèmes de mesure, d’instrumentation et d’analyse placés en amont avec des logiciels de création et d’art numérique tel que TouchDesigner.\nContraintes importantes : l’entièreté de la chaîne doit pouvoir s’adapter à la personne qui en fait l’expérience, le fonctionnement doit être (quasi) temps-réel et l’installation doit se faire très rapidement (idéalement sans besoin d’un assistant ou médiateur).\n"},"Présentation-entreprise":{"title":"Présentation entreprise","links":[],"tags":[],"content":"Missions\nLes missions de Ohme sont assez variées. Cela va de l’organisation d’exposition, de la consultance artistique ou production à la recherche et développement scientifique. La recherche est toujours appréhendée avec une approche “ArtSciences”. Ce néologisme peut se définir en 2 phrase comme tel : ArtScience est une nouvelle façon d’explorer la culture, la société et l’expérience humaine qui intègre l’expérience synesthésique à l’exploration analytique. C’est connaître, analyser, expérimenter et ressentir simultanément. En pratique, cela veut dire que la recherche vient souvent appuyer un projet artistique, ou fournir des outils et dispositifs qui renforce l’expérience artistique. D’une certaine manière apporter des éléments que l’approche artistique ne pourra sans doute pas fournir.\nOrganisation de l’entreprise\nL’entreprise est séparée en trois grandes parties : Lab, Studio et Academia.\nLAB\nUn centre de R&amp;D qui développe des technologies et propose des services de conception, prototypage et fabrication pour des artistes et des designers. C’est surtout dans cette structure que le stage va prendre place.\nStudio\nCompagnie de production qui développe des installations, performances, événements et expositions, et qui accompagne des artistes dans le développement de leurs projets.\nAcademia\nUn institut d’éducation et de recherche qui développe des programmes académiques et encourage la recherche transdisciplinaire entre art et science. En lien avec des écoles comme la Cambre, ULB ou ECAM par exemple.\nEnjeux et organisation du travail\nAnalyse"},"Présentation-outils":{"title":"Présentation outils","links":[],"tags":[],"content":"Google workspace\nTODO"},"index":{"title":"index","links":["CV_Philippe_Mutkowski.pdf","Lettre-de-motivation","Objectifs-et-tâches","Attentes","Présentation-entreprise","Présentation-outils","Log-book/Tracker.ods","Log-book/À-propos-de-la-candidature","Log-book/Semaine-1","Semaine-2","Feedback-from-supervisor","Self-evaluation","Analysis-of-the-evaluation"],"tags":[],"content":"General\nCV\nLettre de motivation\nObjectifs et tâches\nAttentes\nPrésentation entreprise\n\nProject management\nPrésentation outils\nRapports\nTracker\nÀ propos de la candidature\n\nSemaine 1\nSemaine 2\nEvaluation\nFeedback from supervisor\nSelf evaluation\nAnalysis of the evaluation"}}