{"Analyse-de-l'évaluation":{"title":"Analyse de l'évaluation","links":[],"tags":[],"content":"L’évaluation rendue par Raoul a été profondément positive et enrichissante. Ce retour m’a non seulement remotivé, mais il m’a également rassuré sur la qualité du travail que j’ai accompli et sur ma place dans l’entreprise. Certains aspects de ses remarques m’ont particulièrement touché, renforçant mon sentiment d’être vraiment le bienvenu et à ma juste place dans ce milieu.\nJe suis fier du chemin parcouru au cours de ce stage, malgré des moments de doute sur la qualité de mon travail. Le feedback a mis en lumière les aspects réussis de mes contributions, tout en me permettant d’identifier clairement les points à améliorer. Je suis tout à fait d’accord avec les axes d’amélioration évoqués par Raoul, notamment l’importance de prendre du recul. Cela m’arrive parfois de m’enfermer dans une vision trop spécifique, et cette réflexion m’a aidé à comprendre l’importance de garder une approche plus large et flexible.\nUn autre point soulevé, qui résonne particulièrement avec moi, est l’amélioration de mes capacités à présenter mon travail dans un contexte corporate. Bien que j’aie eu quelques occasions de m’y exercer brièvement, je réalise à quel point il est crucial de pouvoir transmettre efficacement mes idées. C’est une compétence précieuse que je suis déterminé à développer davantage à l’avenir, en commençant avec la présentation de stage.\nCe retour m’a permis de renforcer ma confiance et de mieux me projeter dans ma carrière. Je repars avec des apprentissages concrets, un sentiment de fierté, et une motivation renouvelée pour continuer à m’améliorer."},"Attentes":{"title":"Attentes","links":[],"tags":[],"content":"Au début du stage\nMon travail va beaucoup consister en de la recherche, donc j’ai très hâte de toucher à ce genre de tâches. En général je sais que je peux me fasciner pour un sujet assez intensément et rapidement, j’attends de voir comment je vais gérer le fait de garder cette passion dans le temps.\nJe ne sais pas exactement à quoi m’attendre au niveau exigence de la qualité de travail et de deadlines, je peux être parfois assez perfectionniste et du coup assez lent quand je code, je devrais trouver un équilibre pour être efficace tout en étant satisfait de mon travail.\nC’est un domaine et un milieu qui m’intéresse beaucoup, donc j’espère laisser une impression durable dans le temps et comprendre un peu mieux le milieu de l’art et la place de l’ingénieur dans celui-ci.\nJ’espère paraitre intéressé et motivé. Je sais que je peux parfois être négligent sur l’aspect communication, donc je devrais veiller à faire un effort à ce niveau là."},"Feedback-du-superviseur":{"title":"Feedback du superviseur","links":["Interns-performance-evaluation-form_Philippe-MUTKOWSKI_RS.pdf","Analyse-de-l'évaluation"],"tags":[],"content":"Téléchargez le pdf de l’évaluation ici.\nLisez mon analyse personnelle ici."},"Lettre-de-motivation":{"title":"Lettre de motivation","links":[],"tags":[],"content":"Bonjour,\nPermettez moi de me présenter brièvement, je suis étudiant en MA1 en ingénierie informatique à l’école polytechnique de Bruxelles (Université libre de Bruxelles). Dans le domaine de l’informatique, je suis intéressé par la computer vision, le traitement de signal et la micro-informatique. En dehors de mes études je suis passionné de musique, je joue dans quelques projets et j’apprends la production musicale depuis quelques années déjà.\nJ’ai entendu parler d’Ohme par des amis de l’ULB qui ont effectué un stage chez vous. En parcourant les projets d’Ohme, j’ai immédiatement ressenti une affinité avec votre entreprise. Votre mission et votre approche correspondent parfaitement à mes aspirations professionnelles. Je suis convaincu que je pourrais apporter une contribution significative à votre équipe grâce à mes compétences et mon enthousiasme.\nJe suis actuellement à la recherche d’un stage de MA2, d’une durée de 3 mois, s’étalant d’août à octobre. Si votre entreprise est à la recherche d’un stagiaire durant cette période, je serais ravi de vous rencontrer pour discuter plus en détail de ma candidature.\nJe vous prie de trouver ci-joint mon CV. Je vous remercie pour l’attention que vous porterez à ma candidature.\nBien cordialement,\nPhilippe Mutkowski"},"Log-book/Log-book":{"title":"Log book","links":[],"tags":[],"content":""},"Log-book/Semaine-1":{"title":"Semaine 1","links":[],"tags":[],"content":"Logs\n29-09-24\nQuoique anecdotique, je voulais tout de même partager une nouvelle technique qu’un de mes collègue utilise pour communiquer avec chatGPT. Cela consiste à lui détailler un contexte précis et ensuite réaliser un “mind dump”, c’est à dire donner pleins d’idées en vrac, peu ou pas structurées du tout. Il arrive à créer quelque chose d’assez pertinent et permet de structurer ses pensées. Utile typiquement au début de nouveaux projets.\nRapport hebdomadaire\nSemaine 26/9 : déménagement\nLe début de semaine a consisté à déménager les bureaux. Bien que les tâches réalisées sont à des années lumières de ce qui était prévu dans ma convention de stage, cela m’a tout de même permis de rencontrer l’équipe dans un contexte un peu plus détendu. J’ai pu en apprendre d’avantage sur le fonctionnement de l’entreprise. Quelles sont leurs missions, quel est le rôle des gens dans l’équipe.\nLa 2e partie de la semaine consistait surtout à lire les travaux précédent les miens pour comprendre entre autre les outils que je vais utiliser pour le projet “biométrie”. J’ai lu le mémoire qui parlait de la réalisation de la chaîne d’acquisition utilisée par Ohme pour utiliser des signaux EEG. Il y a quelques concepts que j’étoffe avec le cours d’instrumentation donné en option électro-mécanique.\nRaoul m’a également montré les outils utilisés pour organiser le travail au sein de l’entreprise. C’est un environnement Google workspace. La puissance étant la centralisation du calendrier et des tâches. Il m’a montré le drive avec les dossiers pertinents pour mon projet et expliqué ce qui a sa place dedans.\nJe me sens bien intégré pour l’instant malgré la semaine (d’après eux) bizarre et inhabituelle pour un début de stage."},"Log-book/Semaine-10":{"title":"Semaine 10","links":[],"tags":[],"content":"Résumé hebdo\nCette semaine était un peu plus calme que d’habitude, une partie de l’équipe était partie en voyage, donc nous n’étions pas nombreux au bureau.\nLa grande mission était de configurer et tester les 18 raspberry pico. Il a fallu souder les headers sur les boards, ensuite flash l’OS, et tester le code pour voir si le pico était bien fonctionnel.\nJ’ai coupé ma journée avec cette activité là pour éviter de devoir faire tout ce travail à la chaîne en un coup. J’ai avancé sur le déroulement du workshop en parallèle. J’ai eu une idée un peu différente, je l’ai explorée en cette fin de semaine en autonomie. Mon idée est de donner un projet TouchDesigner de type “sandbox”. J’ai développé plusieurs “zones”, plusieurs outils, et après l’introduction, les gens devraient explorer en autonomie.\nIl y a eu une grande réunion d’organisation sur les résidences de l’année prochaine et la manière d’organiser le travail à l’avenir. Ça a pris toute la matinée, c’était assez fatiguant. Je me rend compte que dans une entreprise de cette taille là, le fonctionnement et les missions de chacun sont voués à pas mal évoluer avec le temps."},"Log-book/Semaine-11":{"title":"Semaine 11","links":[],"tags":[],"content":"Rapport hebdo\nCette semaine était surtout passée à finir et documenter mon travail.\nNous avons eu une discussion avec Nicolas, il m’a dit qu’ils étaient assez satisfait de mon travail, et m’a proposé l’opportunité de revenir fin novembre comme jobiste chez Ohme afin d’animer l’atelier à Curieucity. Cela m’a beaucoup motivé, parfois ça m’arrivait de me demander si mon travail était pertinent pour l’entreprise. Mais je ne sais pas encore si je pourrais débloquer le temps sur un weekend pour le faire sachant que je serai en blocus, donc j’ai demandé à Nicolas de me dire quand le LAB aura une réunion de planification pour que je donne ma décision finale à ce moment là. C’était une idée qui lui convenait.\nDurant cette dernière semaine, j’ai récolté le feedback d’une grande partie de mes collègues sur le déroulement du workshop, si tout était bien clair, juger de leur prise en main et adapter en fonction, et en général les remarques globales. C’était vraiment très intéressant et enrichissant d’avoir le point de vue de gens qui ne travaillent pas dans la technique, je retiens des choses précieuses pour les prochaines fois que je devrai présenter ou vulgariser mon travail. Sur quelques itérations, le workshop s’est beaucoup transformé et amélioré.\n\nJ’ai également écrit un document très complet sur mon travail technique. J’y ai également mis les considérations, améliorations, les feedbacks des autres collègues.\nJ’ai présenté mon travail à François et à Andrew (lab) pour qu’ils sachent facilement reprendre mon travail (et puis pour avoir leur avis, François connait très bien le logiciel TouchDesigner).\nVendredi soir juste avant 18h, j’ai fini avec la présentation de la dernière itération avec Chloé (production) et Raoul, qui ont apprécié la présentation, donc le stage se finit sur une bonne note.\nAprès ces 3 mois de dur labeur, c’était l’heure de fêter cette fin de stage en bonne compagnie.\n"},"Log-book/Semaine-2":{"title":"Semaine 2","links":[],"tags":[],"content":"Rapport hebdomadaire\nSemaine 2/9 : lancement\nMardi j’ai eu réunion avec François, responsable du LAB, pour parler du projet avec Antoine Bertin, mon second gros projet du stage. Il a commencé par m’expliquer l’état du projet et ce qu’Antoine avait en tête pour l’instant en attendant la résidence artistique qui aura lieu la semaine prochaine. Cela concerne la représentation de fichier sonore en objet 3D, possiblement et idéalement imprimables en 3D. Dans ce cas les fichiers sont les chants de beluga.\nIl m’a présenté les codes qu’ils s’étaient échangés avec Sara (chercheuse de ESP), ses premiers essais de représentation et ses premiers essais à l’imprimante 3D.\n\nNous avons également parlé du logiciel de 3D Blender. Cette application open-source est l’outil parfait pour ce genre de tâche car il y a une intégration assez puissante de python pour réaliser du “scripting”. Donc nous pouvons directement représenter les données traitées comme des objets 3D. J’étais familier avec Blender, mais beaucoup moins avec le scripting et certains autres aspects assez précis, donc François m’a tout expliqué en vitesse.\nMes tâches dans un premier temps étaient de me familiariser avec les codes de Sara et François, le type de données à disposition, Blender. J’ai bien mis une journée pour tout faire marcher correctement sur mon système, en documentant le tout afin de faciliter l’execution du code sur d’autres machines comme celle d’Antoine par exemple. Une fois que tout fonctionnait bien, je devais continuer le travail de représentation. François m’avait prévenu que c’était un travail très exploratoire, il n’y avait que très peu de directives en réalité. J’ai alors beaucoup chipoté en autonomie.\nEn résumé j’ai :\n\nnettoyé le code de François qui génère les formes, un peu modifié celui ci, testé avec plusieurs types de chants.\nessayé de structurer les chants en “clusters”, c’est à dire regrouper les chants proches dans une même zone de l’espace.\nréalisé une représentation dans le temps : j’ai traité le son (en le séparant en 3 bandes de fréquences) et fait bouger la forme dans le temps en appliquant les différentes couches du chant à certains paramètres. Cela vient d’une initiative personnelle, je suis passionné de production musicale, donc je connais bien les outils de traitement de son, je trouvais cela intéressant et je suis assez satisfait du rendu. \n\nJ’avais peur au début de ne pas savoir quoi faire ou d’avoir des tâches trop rapides, mais entre la prise en main d’un nouveau logiciel, et les idées qui viennent en cours de route, je suis arrivé à garder un certain cap dans mon travail. Je pense avoir bien géré cette fin de semaine où François n’était pas là.\nRessenti\nLe début de semaine s’est déroulé dans des bureaux toujours dans un flou post-déménagement. Ce n’était pas le plus confortable. Dans un effort collectif, vendredi, les bureaux et la cuisine ont enfin été aménagés en quelque chose d’agréable pour tout le monde.\nJe tombe également dans un contexte d’accueil de nouvelles personnes dans l’équipe, c’est intéressant de discuter et voir comment une nouvelle personne s’intègre dans l’entreprise."},"Log-book/Semaine-3":{"title":"Semaine 3","links":[],"tags":[],"content":"Logs\n9/9/24\nBonne humeur générale quant au fait d’arriver dans des bureaux rangés, décorés et aménagés. Petite réunion avec François le matin, assez satisfait de mon travail de la semaine passée. Réunion de groupe du lundi. J’ai remis en commun plusieurs de mes codes de la semaine passée.\n11/9/24\nJournée intéressante avec Antoine. Dynamique de travail intéressante avec Antoine et Camilla, ils avaient une réu plutôt axée “production artistique” et pendant leur discussions ils me demandaient des sous-tâches, comme simuler le placement des 80 personnes dans une salle pour la performance de Curieucity le 27 septembre. C’est intéressant d’entendre le lien entre le travail technique de François et moi et sa vision artistique.\nRapport hebdo\nSemaine 9/9 : traduction artiste-ingé\nCette semaine était rythmée par la présence d’Antoine Bertin, l’artiste avec qui on collabore sur le projet “Beluga”. Il est arrivé de Paris dans la journée de mardi, on a commencé par faire connaissance tous ensemble autour d’un café et ensuite on lui a montré les avancées, idées et possibilités développées au cours de la semaine dernière. Il a détaillé plus en profondeur sa vision de l’oeuvre pour que tout le monde soit à la même page, et nous avons fixé les objectifs et tâches de la semaine restante.\nLes tâches étaient d’explorer différents types de représentations pour les sons, ceux qui donnent le mieux pour l’impression 3D, mais aussi que ça soit intéressant comme objet pour appuyer le récit d’Antoine. Donc c’était vraiment une question de lier l’artistique à la dimension scientifique (la mission clé de Ohme).\n\nCe nouveau type de représentation a également été pensé pour mieux suivre les données brutes obtenues en sortie du modèle de machine learning (AVES). Un des sous-objectifs de tout ce projet est de potentiellement donner des outils de représentation visuels aux chercheurs de ESP. Des outils qui eux doivent être factuels. Toutes ces formes sont générées via l’API python de Blender.\nNous avons également commencé les tests de shading et rendering basés sur la vision d’Antoine.\n\n\nCette mission va être explorée + en détail la semaine prochaine.\nPour la gestion de mon planning, comme je suis en contact assez proche avec Antoine et François, mes tâches sont souvent très claires et je n’en ai pas énormément à la fois. Cela vient du fait que je peux rapidement communiquer mes résultats, problèmes ou idées afin d’évaluer de nouvelles tâches ou rediriger celles-ci. Je n’utilise qu’une todo list assez globale et un fichier de notes pour les idées et les pistes déjà explorées.\nRelationnel\nLe travail en groupe avec François et Antoine est assez constructif. Antoine arrive à faire comprendre ses idées très clairement, je pense que j’arrive à cerner plutôt bien sa vision et guider mon travail sur base de ça. Tout les midis l’équipe mange en grande partie ensemble, je me sens plutôt intégré. Parfois je prend partie aux dernières tâches de déménagement (vider le garage par exemple). On est toujours plusieurs à s’y atteler, ça ajoute un sentiment d’appartenance à l’équipe et à la cohésion de groupe."},"Log-book/Semaine-4":{"title":"Semaine 4","links":["Réunions-du-lundi"],"tags":[],"content":"Log\n16/09/24\nCe matin l’équipe a accueilli Andrew, le nouveau responsable LAB. J’ai pu discuter avec lui du stage, il l’a également réalisé chez Ohme il y a 2 ans venant des mêmes études que moi. Réunion du lundi comme chaque semaine avec toute l’équipe.\nRéunion super intéressante avec Denis Meyers qui a pitché un projet pour lequel il voulait travailler avec Ohme. Intéressant de voir la naissance d’un nouveau projet.\n17/09/24\nUne reflexion : j’entraine mes skills de pitching : j’ai souvent l’occasion d’expliquer mon projet, que ça soit en small talk dans le couloir ou à Ophelia de la communication, je sens que j’explique ce projet de plus en plus clairement à chaque fois.\nRapport hebdo\nSemaine 16/10 : rendu blender et impression 3D\nAu niveau technique, le début du stage était surtout lié à de l’optimisation. Le code marchait pour générer une seule forme, mais il fallait en générer 80 su le même fichier Blender. Je travaillais en étroite collaboration avec Andrew, les solutions que nous avons trouvé étaient de générer les formes avec des objets plus légers, de calculer les données à l’avance et de comprendre les opérations Blender qui prenaient beaucoup de temps pour arriver à les éviter le plus possible dans les boucles. Nous y sommes arrivés finalement et nous avons un peu entamé la tâche de la visualisation. C’est à dire créer une scène intéressante que l’on pourrait projeter pendant la performance d’Antoine par exemple. Il y a des challenges majeurs car générer une scène 3D est quelque chose de très long en général. Il faudra réfléchir comment créer une scène qui pourrait s’exporter assez rapidement, tout en étant esthétique et dans la vision artistique d’Antoine.\nRelationnel\nCette semaine c’était l’arrivée de Maria, stagiaire en programmation culturelle à l’ULB et de Andrew, responsable LAB. Comme avec Ophelia au début de mon stage, c’est intéressant de voir comment eux s’intègrent à l’équipe et c’est enrichissant de pouvoir discuter avec de leur ressenti et leur vécu du stage et au sein de l’entreprise.\nJeudi je suis resté en télétravail, mais j’ai oublié de prévenir l’entièreté de l’équipe, petite erreur de ma part à ce niveau là.\nUn des challenges du projet était l’impression en 3D de ces 80 formes pour le vendredi 27 septembre. Nous avons réussi à avoir l’accès aux imprimantes du FabLab ULB toute la journée. C’était une journée plus légère au niveau de l’ambiance générale j’ai l’impression. Mais tout de même, quand il ne fallait pas préparer les bobines de filament ou superviser l’impression, nous avancions à 2 sur la tâche de rendering 3D avec Andrew.\n"},"Log-book/Semaine-5":{"title":"Semaine 5","links":[],"tags":[],"content":"Rapport hebdo\nSemaine 23/10 : rush final\nCette semaine a consisté à terminer les préparatifs pour la performance d’Antoine Bertin qui se déroule à CurieuCity le 27 septembre.\nTechnique\nLes premiers jours étaient surtout des tests de rendering pour la scène blender. Il fallait une boucle de ±10 minutes, donc pour exporter ceci dans une bonne qualité, il fallait réaliser des optimisations. Premièrement comprendre ce qui prenait du temps dans le processus de rendu, et ensuite en faisant des recherches, voir comment ajuster les paramètres pertinents.\nUne grande mission de la 2e partie de la semaine était de réaliser une scène et un mouvement de camera visuellement intéressant et esthétique, tout en demandant à Antoine ce qu’il avait en tête pour guider le processus.\nJeudi après-midi, nous avons réceptionné la location des lumières et organisé une petite répétition pour roder la technique pour le lendemain, notamment apprendre à piloter les lumières. Jeudi soir je lançais le rendu 3D final, et avec un temps estimé de 10h ±, nous n’avions pas énormément droit à l’erreur, ce qui était un peu stressant, mais avec l’apprentissage du logiciel ces dernières semaines, nous étions confiants.\n\nToute la journée de vendredi dès le matin était l’installation du matériel pour la performance d’Antoine, c’est à dire configurer correctement les lumières, la projection et les casques sans fils en plus de tout le travail de placement des sculptures et coussins dans la salle. La performance était un succès, tout s’est bien déroulé et la fin de soirée jusque 23h était occupée au démontage et au rapatriement des affaires jusqu’à Ixelles.\n\nRessenti\nC’était une semaine assez chargée, il y avait beaucoup de choses à finir avant vendredi, et l’organisation de travail était très “au jour le jour” en fonction des tâches les plus urgentes, mais je me suis retrouvé là dedans. Le travail était souvent partagé entre moi et Andrew, le nouveau responsable lab.\nVendredi, pendant la journée de montage je me suis senti utile et inclus dans l’équipe. Il régnait une bonne ambiance globale, ce n’était pas trop stressant malgré le nombre de choses à faire pendant la journée. C’est très satisfaisant de voir la réalisation d’un projet sur lequel nous avons travaillé en équipe pendant ces dernières semaines. Je trouve que j’ai de la chance de réaliser un stage avec une mission qui se cloture aussi tangiblement.\n"},"Log-book/Semaine-6":{"title":"Semaine 6","links":[],"tags":[],"content":"Logs\n3/10/24\nJe me sens un peu perdu au début de cette nouvelle phase de stage, j’ai du mal à retracer le fil du travail et repartir du travail effectué auparavant.\nRapport hebdo\nSemaine 30/9 : flou dans les EEG\nJ’ai surtout travaillé à continuer le travail sur les EEG dans le but de développer certaines idées dans le but de la résidence associée. Cependant, j’ai rencontré des difficultés liées à la documentation insuffisante du travail réalisé par les stagiaires précédents, ce qui a rendu la prise en main assez compliquée (j’aurais pu demander plus d’info). J’ai donc passé une bonne partie de la semaine à tâtonner pour comprendre et avancer sur ce qui avait déjà été fait.\nUn élément clé de la semaine a été ma réunion avec Raoul, qui m’a grandement aidé à clarifier les missions à accomplir. Nous avons réévalué les priorités et les enjeux, ce qui m’a permis de mieux structurer mon travail. Cette réunion m’a également fait réaliser l’importance de demander plus de feedbacks, car cela me motive beaucoup et me permet d’avancer plus sereinement, en plus d’être assez motivante."},"Log-book/Semaine-7":{"title":"Semaine 7","links":[],"tags":[],"content":"Rapport hebdo\nSemaine 7/10 : midterm et TouchDesigner.\nCette semaine a été relativement calme, en début de semaine, j’ai participé à une réunion avec le reste de l’équipe du LAB, ce qui m’a permis de structurer mon travail et d’avoir une vision plus claire des tâches à accomplir pour les semaines à venir. Nous avons notamment analysé les échéances à venir, ce qui a été très utile pour organiser mon travail.\nSur le plan technique, j’ai consacré le reste de la semaine à l’apprentissage de TouchDesigner, en préparation du workshop Biometrika.\nJ’ai également pris le temps de réfléchir à mon propre parcours après le mid-term, et j’ai réalisé que je dois améliorer ma capacité à poser des questions, ou réussir à trouver plus de moments creux où je peux discuter de manière plus “organique”."},"Log-book/Semaine-8":{"title":"Semaine 8","links":[],"tags":[],"content":"Logs\n13/10/24\nJe me suis rendu compte que le stage dans une entreprise plutôt créative comme Ohme a ravivé en moi un élan curiosité, ou en tout cas j’arrive à canaliser celle-ci dans des projets qui s’inscrivent dans une mission plus générale. Je pense que c’est quelque chose que je vais rechercher dans un futur travail, avoir des projets très différents où il faut imaginer et trouver des solutions créatives.\nRapport hebdo\nJ’ai continué la mission de développer le workshop qui s’inscrit dans le projet Biometrika. J’ai connecté un capteur de fréquence cardiaque piloté par raspberry pico qui envoie des données en wifi vers le logiciel TouchDesigner. Voici un aperçu de la visualisation avec ma propre pulsation.\n\nLa fin de semaine était remplie par le montage de la journée ArtSciences et l’expo de rentrée. Le vernissage était vendredi soir, j’ai su discuter avec beaucoup de mes collègues de manière beaucoup plus informelle, c’était un bon moment de teambuilding."},"Log-book/Semaine-9":{"title":"Semaine 9","links":[],"tags":[],"content":"Log\n22/10\nJ’étais fort malade ce jour là, j’ai du télé-travailler, je me rend compte que c’est quelque chose qui ne me déplait pas. Je préfère tout de même être sur site, la bonne ambiance au bureau est un grand + pour moi.\nRésumé hebdo\nCôté technique j’ai écrit des codes de test pour recevoir des données en wifi venant de microcontrollers “Raspberry Pico”. La commande des Raspberry arrive début de semaine prochaine, donc je prépare le terrain pour pouvoir avancer le plus vite possible une fois qu’on les reçoit. J’ai travaillé en parallèle sur l’élaboration du déroulement du workshop, je devrais finir ça pour la semaine prochaine, donc j’ai bien avancé là dessus.\nJ’ai du réalisé une tâche pour Antoine Bertin, l’artiste avec qui nous avons travaillé au début de mon stage, qui a demandé un nouveau render d’un nouveau dataset avec une nouvelle représentation 3D. J’ai accepté la tâche, car je pensais que ça se ferait assez vite, mais la fin de semaine a été entrecoupée de diverses réunions, donc je me suis retrouvé à devoir finir ceci après 18h vendredi. Sur cette tâche là je trouve que j’ai mal géré mon temps, j’aurais du être + efficace dès le début et moins dans l’exploration. Au final il était satisfait, et il y a eu évolution par rapport à ce dont on a parlé au midterm, j’ai pris les devants et j’ai directement communiqué avec lui."},"Log-book/content.index":{"title":"content.index","links":[],"tags":[],"content":""},"Log-book/À-propos-de-la-candidature":{"title":"À propos de la candidature","links":["CV_Philippe_Mutkowski.pdf","Lettre-de-motivation"],"tags":[],"content":"CV\nLettre de motivation\n\nAu moment de contacter une entreprise je prenais le soin de me renseigner sur celle ci et d’adapter mon CV en conséquence en mettant en valeur les compétences et intérêts pertinents pour le job. Quelques exemples : l’ajout de mes compétences de logiciels créatifs lors de ma candidature chez Ohme ou la mention que je m’intéresse beaucoup à la micro informatique lors de ma candidature chez Keymesis (entreprise de recherche et réalisation de prototypes).\nJe n’ai pas reçu de réponse de Raoul Someillier (Ohme), l’entreprise étant dans une période de rush, mes mails se sont perdu dans la masse. J’ai obtenu un entretien en parlant de ma situation à Cédric quelques semaines plus tard qui a directement contacté Raoul par téléphone. J’ai eu une entrevue avec Raoul le jour même. Cela m’a fait réaliser l’importance des contacts, et le fait d’entretenir des relations professionnelles saines et durables. J’ai pu confirmer ce constat en parlant avec d’autres amis et collègues lors du stage."},"Objectifs-et-tâches":{"title":"Objectifs et tâches","links":[],"tags":[],"content":"Ceci sont les tâches détaillées par Raoul Someillier, mon maitre de stage, à l’approche du début de celui-ci.\nProjet 1 : AI, communication inter/intraspécifique et visualisation\nIl s’agit d’un projet de R&amp;D et de soutien technique en collaboration avec l’artiste Antoine Bertin qui est en résidence chez nous.\nLes collaborateurs scientifiques sont des chercheurs du Earth Species Project (ESP), issus de diverses universités (surtout américaines). L’intention de leur travail de recherche est bien synthétiser sur leur site:\n“Our work to decode communication of other species builds on the extraordinary advances we are seeing in AI being applied to human language, which we are extending to the non-human world.\nIt also builds off many decades of bioacoustics and behavioral ecology research which has already uncovered complex communication systems in other species.\nThe machine learning models we are building are also supporting and deepening ongoing research into the behavior of other species and advancing conservation efforts on the ground today.”\nDans le cadre de notre collaboration, on s’intéresse surtout à la communication entre mammifères marins, en particulier des belugas.\nL’objectif est donc d’enregistrer une grande quantité de “discussions” entre belugas (par exemple entre une mère et son petit) et d’utiliser ces enregistrements audio comme data en input de modèles de machine learning (dans la même idée que des modèles de langage type ChatGPT mais pour la communication animale, donc sans la possibilité de transcrire en format texte). L’objectif ultime est donc de tenter de comprendre ce que les belugas se racontent. Mais avant ça, il faut faire de l’analyse audio pour déterminer les diverses dimensions impliquées, réduire la dimensionalité et compléter ce travail par des analyses comportementales.\nUn modèle développé par les chercheurs de ESP est AVES (Animal Vocalization Encoder based on Self-Supervision) : “a self-supervised, transformer-based audio representation model for encoding animal vocalizations (“BERT for animals”)“.\nLa mission du Ohme Lab dans ce projet est de :\n\nSe baser sur les travaux de ESP pour développer un code permettant d’analyser des vocalisations de beluga (dans un premier temps, peut-être aussi d’autres animaux par la suite, à voir).\nVisualiser le résultat de cette analyse, dans le sens de “rendre visuel” sur base de critères esthétiques définis avec Antoine Bertin.\nA noter que nous faisons aussi toujours attention au sens et à la vocation pédagogique de nos projets. Il s’agit donc également de faire en sorte que ces visualisations puissent être utilisées comme base pour expliquer des phénomènes scientifiques au grand public.\nModéliser ces visualisations afin de réaliser des sculptures tridimensionnelles (via impression 3D ou autre méthode de prototypage et de fabrication)\n\nProjet 2 : Biométrie, interactivité et rétroaction entre oeuvres et réactions humaines\nCe projet s’inscrit dans un axe de R&amp;D interne à Ohme qui vise à créer des boucles de rétroaction entre une oeuvre (installation d’art numérique, composition musicale, performance ou autre) et les réactions physiologiques, sensorielles, mentales et émotionnelles de la personne qui en fait l’expérience (spectateur ou performeur).\nEn d’autres termes, il s’agit de concevoir des œuvres qui provoquent des réactions humaines, de développer des technologies permettant de mesurer ces réactions, et d’utiliser ces mesures pour faire évoluer l’œuvre de façon dynamique et en temps réel.\nL’idée est donc :\n\nde développer des capteurs biométriques (ou adapter/hacker des technologies déjà existantes) servant à mesurer les réactions physiologiques humaines. Quelques exemples de capteurs : casque EEG pour mesurer les rythmes cérébraux, capteur de pression pour les pas, caméra depthsensing pour les déplacements, ECG pour les battements du coeur, etc.).\nd’envoyer ces signaux de mesure en wireless à un PC.\nde filter et d’analyser ces mesures pour en déduire des variations sur les états mentaux et/ou émotionnels des personnes qui portent ces capteurs biométriques.\nde visualiser ces variations afin qu’elles fassent partie intégrante de l’œuvre et/ou d’utiliser ces variations pour faire évoluer l’œuvre (au niveau sonore, visuel, cinétique ou autre).\nCes “évolutions” de l’oeuvre peuvent soit renforcer le changement d’état de la personne (rétroaction positive), soit l’atténuer (rétroaction négative). Avec toujours comme volonté que cela nous permette d’utiliser cette expérience vécue par le spectateur comme un moyen de mieux comprendre et d’acquérir de nouvelles connaissances (sur le fonctionnement de notre cerveau, de nos émotions, des technologies employées, etc.)\n\nComme décrit dans ta convention de stage, les missions concernent 3 volets :\n\nLe développement d’une boîte à outils software et hardware capable de recevoir en input une grande quantité de signaux provenant de capteurs biométriques et environnementaux.\nLe développement d’un modèle AI de classification capable de déterminer en temps réel les (variations d’) états émotionnels et mentaux d’une (ou plusieurs) personnes sur base des mesures prises par des capteurs biométriques.\nLa visualisation et la sonification des signaux (input et output), ce qui requiert la compatibilité des systèmes de mesure, d’instrumentation et d’analyse placés en amont avec des logiciels de création et d’art numérique tel que TouchDesigner.\nContraintes importantes : l’entièreté de la chaîne doit pouvoir s’adapter à la personne qui en fait l’expérience, le fonctionnement doit être (quasi) temps-réel et l’installation doit se faire très rapidement (idéalement sans besoin d’un assistant ou médiateur).\n"},"Présentation-entreprise":{"title":"Présentation entreprise","links":["Présentation-outils"],"tags":[],"content":"Missions\nLes missions de Ohme sont assez variées. Cela va de l’organisation d’exposition, de la consultance ou production artistique à la recherche et développement scientifique ainsi que la diffusion et la vulgarisation de la science. La recherche est toujours appréhendée avec une approche “ArtSciences”. Ce néologisme peut se définir en 2 phrase comme tel : ArtScience est une nouvelle façon d’explorer la culture, la société et l’expérience humaine qui intègre l’expérience synesthésique à l’exploration analytique. C’est connaître, analyser, expérimenter et ressentir simultanément. En pratique, cela veut dire que la recherche est souvent motivée par des raisons artistiques, cela permet d’amener et de parler au grand public d’un phénomène ou d’un sujet d’une manière un peu différente de ce que l’ont peut imaginer quand on entend un mot aussi sérieux que “science”.\nL’entreprise Ohme fournit des outils et dispositifs qui renforcent l’expérience artistique, elle apporte des éléments que l’approche artistique seule ne pourra sans doute pas fournir, et réciproquement, elle permet de toucher l’imaginaire de manière inédite, là où la science, seule, peut parfois manquer de cette dimension poétique et sensible.\nOrganisation de l’entreprise\nL’entreprise est séparée en trois grandes parties : Lab, Studio et Academia.\nLAB\nUn centre de R&amp;D qui travaille sur des technologies utilisées à des fins artistiques et propose des services de conception, prototypage et fabrication pour des artistes et des designers. Il s’agit de la seule section de l’entreprise pensée pour générer du profit en acceptant des missions courtes purement techniques pour répondre à un besoin d’un artiste. C’est surtout dans cette structure que le stage va prendre place.\nStudio\nCompagnie de production qui développe des installations, performances, événements et expositions, et qui accompagne des artistes dans le développement de leurs projets.\nAcademia\nUn institut d’éducation et de recherche qui développe des programmes académiques et encourage la recherche transdisciplinaire entre art et science. En lien avec des écoles comme la Cambre, ULB ou ECAM par exemple.\nL’équipe\nJe trouve que ce diagramme représente plutôt bien l’ensemble de l’entreprise et la distinctions des trois pôles, mais aussi les chevauchements potentiels. Chacun a son rôle relativement bien défini, mais tout de même, certaines missions dépassent les lignes de son pôle, et la collaboration est toujours la bienvenue. Par exemple, Raoul, de par sa formation d’ingénieur est assez présent au lab, que ça soit pour donner des idées ou du feedback.\nL’équipe était un peu dans une période de transition, définie par l’arrivée d’Ophelia, responsable communication, et Andrew qui va remplacer François en tant que responsable LAB en décembre. Il y avait également Maria, étudiante en programmation culturelle à l’ULB qui faisait son stage en même temps que moi.\n\nEnjeux et organisation du travail\nLa charge de travail a l’air très variable en fonction des expos et des projets en cours. Souvent, le travail commence avec un entretien avec l’artiste, où on définit un cahier des charges, on discute de ses idées avec lui, on présente ce qui existe déjà. Ensuite cela rentre dans les missions du lab moyen/court terme, où le travail est séparé entre ses différents membres de manière assez organique, privilégiant la communication et le fait de tenir l’équipe au courant de ses avancements.\nDifférents outils d’organisation du travail.\nAnalyse des deadlines\nLes deadlines étaient assez claires en général, l’organisation du travail se fait en fonction de ce qui est le plus urgent, quel artiste est en résidence, s’il y a une expo en préparation. Le LAB s’organise avec des réunions toutes les deux semaines, évaluant les missions de chacun dans les prochains jours. Pendant les périodes d’organisation d’expo, c’était souvent assez difficile d’avancer efficacement sur son travail, la journée est fort entrecoupée de missions secondaires, cela peut parfois durer quelques jours sur la semaine en période de rush."},"Présentation-outils":{"title":"Présentation outils","links":["Réunions-du-lundi"],"tags":[],"content":"Google workspace\nL’outil d’organisation de travail est google workspace. La puissance de cet outil réside dans le fait que tout est connecté. Par exemple chacun peut créer une réunion, puis envoyer une invitation sur gmail dans le même menu. Ou bien avoir des “to-do” lists personnelles étoffées par des tâches attribuées à soi. L’outil Google chat est quelque chose de très pratique, ça permet une communication + instantanée que les mails, mais pas aussi informelle que Whatsapp par exemple, que l’on utilise parfois pour de l’organisation plus rapide lors du montage d’expo ou des informations rapides.\nRéunion du lundi\nL’entièreté de l’équipe se réunit tout les lundis afin de discuter de l’avancement des projets en cours, discuter des deadlines, des nouvelles propositions de projets, etc… Plus de détails ici : Réunions du lundi."},"Réunions-du-lundi":{"title":"Réunions du lundi","links":[],"tags":[],"content":"Organisation générale\nLe format consiste à ±5 minutes par personnes où chacun présente ses tâches de la semaine, c’est l’occasion pour mettre tout le monde à la page, pour demander de l’aide sur certaines tâches s’il ya besoin et de poser des questions. Je trouve que cela structure bien toutes les tâches court/moyen/long terme et permet de garder une bonne organisation globale de l’entreprise, ce qui est important au vu de tout les aspects très différents, mais très dépendants auxquels touche Ohme. Ces aspects incluent les demandes de financements et de subventions, les relations avec les artistes et la curation, l’organisation pratique et la logistique des expos, les recherches du lab ou la communication."},"Untitled":{"title":"Untitled","links":[],"tags":[],"content":""},"index":{"title":"index","links":["À-propos-de-moi","Log-book/À-propos-de-la-candidature","Objectifs-et-tâches","Attentes","Présentation-entreprise","Présentation-outils","Réunions-du-lundi","Log-book/Semaine-1","Log-book/Semaine-2","Log-book/Semaine-3","Log-book/Semaine-4","Log-book/Semaine-5","Log-book/Semaine-6","Log-book/Semaine-7","Log-book/Semaine-8","Log-book/Semaine-9","Log-book/Semaine-10","Log-book/Semaine-11","Évaluation-personnelle","Feedback-du-superviseur","Analyse-de-l'évaluation"],"tags":[],"content":"General\nÀ propos de moi\nÀ propos de la candidature\nObjectifs et tâches\nAttentes\nPrésentation entreprise\n\nProject management\nPrésentation outils\nRéunions du lundi\n\nRapports\nSemaine 1 : déménagement\nSemaine 2 : lancement\nSemaine 3 : traduction artiste-ingé\nSemaine 4 : rendu blender et impression 3D\nSemaine 5 : rush final\nSemaine 6 : flou dans les EEG\nSemaine 7 : midterm et TouchDesigner\nSemaine 8 : workshop et expo de rentrée\nSemaine 9 : workshop et Antoine Bertin \nSemaine 10 : raspberry pico\nSemaine 11 : clap de fin\n\nEvaluation\nÉvaluation personnelle\nFeedback du superviseur\nAnalyse de l’évaluation"},"À-propos-de-moi":{"title":"À propos de moi","links":["Log-book/À-propos-de-la-candidature"],"tags":[],"content":"Mon nom est Philippe Mutkowski, je suis étudiant en 2e master en polytech option informatique. Je suis en spécialisation intelligence artificielle, mais je m’intéresse énormément à tout ce qui touche au multimedia, la computation visuelle et à l’interaction humain-machine. En dehors de l’académique, je fais de la musique, je suis passionné de design et d’art numérique.\nPourquoi Ohme ?\nAu vu de la description ci-dessus, une entreprise exerçant dans le domaine de l’art comme Ohme faisait beaucoup de sens. Cédric a décrit l’entreprise pendant la présentation du stage en mars, et je me suis dit qu’un stage est l’opportunité parfaite pour découvrir ce milieu. Utiliser mes compétences d’ingénieur dans un contexte un peu alternatif comme l’art est quelque chose que j’avais en tête depuis un moment. J’ai naturellement remis ma candidature."},"Évaluation-personnelle":{"title":"Évaluation personnelle","links":["Attentes"],"tags":[],"content":"Réponse à mes Attentes de début de stage\nMon travail était moins axé recherche comparé à ce que je pensais initialement, les délivrables étaient quand même assez concrets, et évidemment il y a avait toujours une partie de recherche et d’apprentissage, mais c’était fort “sur le tas”, toujours dans le but d’arriver à un résultat précis décrit par l’artiste par exemple, mais j’ai tout de même bien apprécié cette dynamique.\nJe pense avoir réussi le fait de laisser une bonne impression, le fait d’être passionné a beaucoup aidé évidemment et j’en ai en effet beaucoup appris sur le milieu de l’art et la place de l’ingénieur dans celui-ci.\nPoints forts\nMissions en adéquation avec mes intérêts\nDès le début de mon stage chez Ohme, j’ai été affecté à des projets et des missions qui résonnaient avec mes intérêts, ce qui a renforcé ma motivation et mon implication. Travailler dans un environnement mêlant arts et sciences correspond parfaitement à mes aspirations professionnelles.\nCapacité à travailler avec des contraintes de temps\nBien que je ne maîtrisais pas certains outils techniques au départ (surtout Blender et TouchDesigner et leur API python), j’ai su adopter une approche pragmatique, me concentrant sur des solutions fonctionnelles, même si elles n’étaient pas toujours optimales au départ. Cela m’a appris à trouver des solutions dans des délais restreints, en privilégiant l’efficacité et la viabilité des résultats.\nDans un contexte où j’aurais des missions + long terme, avec plus de temps à disposition, je pense que c’est une approche que je vais tout de même essayer de privilégier, tout en incorporant un approfondissement de mes connaissances techniques lors du déroulement du projet.\nCela rejoint un peu la méthodologie agile, le fait de rendre des versions préliminaires du projets assez rapidement et régulièrement pour mieux rectifier la direction du développement et être à jour avec les dernières demandes et considérations.\nAdaptation rapide à de nouveaux outils (TouchDesigner)\nJ’ai appris TouchDesigner en une semaine pour répondre aux besoins d’un projet en cours. Cette capacité d’apprentissage rapide témoigne de ma flexibilité et de mon engagement à maîtriser de nouveaux logiciels en peu de temps pour répondre aux exigences. Un peu en echo au point précédent, j’ai toujours trouvé que la meilleure manière d’apprendre un nouveau logiciel est de se lancer sur un projet et d’apprendre sur le tas, et cette expérience me le confirme une fois de plus.\nContribution créative et pertinente\nAu cours de mes missions, j’ai apporté des idées qui ont été bien accueillies, et j’ai su anticiper les directions que prenait le travail, en alignant mes propositions avec la vision de l’équipe. Cette expérience a renforcé ma confiance en ma capacité à contribuer de manière significative dans un environnement créatif et technique.\nIntérêt pour le changement de contexte et la diversité des projets\nCe stage m’a confirmé que j’apprécie particulièrement les environnements où les projets et les contextes varient. Relever des défis dans des domaines nouveaux me stimule, et j’aime devoir réapprendre et m’adapter continuellement, ce qui nourrit mon enthousiasme pour l’innovation.\n\nTout ces points reflètent l’équilibre entre mes compétences personnelles et mon apprentissage professionnel, en soulignant mon adaptabilité et ma capacité à contribuer de manière créative dans des projets alliant technologie et arts.\nPoints faibles\nManque de technique\nManque de complexité technique dans certaines missions\nBien que les projets aient été stimulants et créatifs, j’ai parfois ressenti un manque de défis techniques complexes, en particulier dans les domaines du code et de l’algorithmie. J’aurais aimé davantage d’opportunités pour appliquer et approfondir des compétences techniques pointues, car c’est un domaine qui me passionne et qui me permet de progresser.\nApproche orientée « solution rapide »\nLa nature des missions, parfois axée sur l’aspect pratique et le “juste fonctionnement” a limité les occasions de développer des solutions techniquement élaborées.\nJ’ai tout de même pu créer des systèmes vraiment robustes, “élégants” et optimisés. J’ai mis beaucoup d’importance sur le fait de rendre mon travail accessible et réutilisable pour le reste de l’équipe.\nSensation de lenteur dans l’exécution\nÀ certains moments, j’ai eu l’impression de progresser lentement par rapport au rythme auquel j’aspirais. Mon besoin de compréhension détaillée de chaque outil ou concept ont parfois ralenti mon avancée. Ce rythme, bien qu’en partie dû à mon souci de qualité, est un aspect que je souhaite améliorer en demandant du feedback plus régulièrement de la part de mes superviseurs.\n\nEn résumé, bien que j’ai été utile et pertinent dans mon travail, j’aurais pu faire plus d’efforts pour appliquer des concepts d’ingénierie et pousser mes recherches pour proposer des solutions peut-être plus innovantes et approfondies afin d’apporter une plus grande valeur ajoutée."}}